{
    "id": "builtin_marvel_universe",
    "name": "Marvel Universe",
    "description": "The Marvel Cinematic Universe (MCU) world setting. Includes superheroes, organizations, powers, locations, and key events. Perfect for creating Marvel-themed roleplay stories.",
    "enabled": false,
    "isGlobal": false,
    "entries": [
        {
            "id": "entry_001",
            "worldInfoId": "builtin_marvel_universe",
            "keys": [
                "Avengers",
                "Earth's Mightiest Heroes"
            ],
            "content": "The Avengers are Earth's Mightiest Heroes, a team of extraordinary individuals assembled to protect the world from threats too great for any single hero. Core members include: Iron Man (Tony Stark), Captain America (Steve Rogers), Thor, Hulk (Bruce Banner), Black Widow (Natasha Romanoff), and Hawkeye (Clint Barton). The team operates from Avengers Tower and later the Avengers Compound.",
            "enabled": true,
            "constant": false,
            "position": 1,
            "insertionOrder": 100,
            "comment": "The Avengers team"
        },
        {
            "id": "entry_002",
            "worldInfoId": "builtin_marvel_universe",
            "keys": [
                "Infinity Stones",
                "Infinity Gauntlet"
            ],
            "content": "The Infinity Stones are six immensely powerful gems that control fundamental aspects of existence: Space (blue, Tesseract), Mind (yellow, Loki's scepter), Reality (red, Aether), Power (purple, Orb), Time (green, Eye of Agamotto), and Soul (orange, requires sacrifice). When combined in the Infinity Gauntlet, they grant the wielder god-like power to reshape reality itself.",
            "enabled": true,
            "constant": false,
            "position": 1,
            "insertionOrder": 90,
            "comment": "Infinity Stones"
        },
        {
            "id": "entry_003",
            "worldInfoId": "builtin_marvel_universe",
            "keys": [
                "S.H.I.E.L.D.",
                "Strategic Homeland Intervention"
            ],
            "content": "S.H.I.E.L.D. (Strategic Homeland Intervention, Enforcement and Logistics Division) is a covert law enforcement and counter-terrorism agency. Led by Nick Fury, S.H.I.E.L.D. deals with superhuman threats and maintains peace. The organization was infiltrated by HYDRA and later reformed after its fall. Key agents include Phil Coulson and Maria Hill.",
            "enabled": true,
            "constant": false,
            "position": 1,
            "insertionOrder": 80,
            "comment": "S.H.I.E.L.D. organization"
        },
        {
            "id": "entry_004",
            "worldInfoId": "builtin_marvel_universe",
            "keys": [
                "Asgard",
                "Nine Realms",
                "Bifrost"
            ],
            "content": "Asgard is one of the Nine Realms, home to the god-like Asgardians. Ruled by Odin (later Thor), Asgard is a golden realm of advanced magic and technology. The Bifrost is a rainbow bridge that allows travel between realms. Other realms include Midgard (Earth), Jotunheim (Frost Giants), and Muspelheim (Fire Demons). Asgard was destroyed during Ragnarok.",
            "enabled": true,
            "constant": false,
            "position": 1,
            "insertionOrder": 70,
            "comment": "Asgard and Nine Realms"
        },
        {
            "id": "entry_005",
            "worldInfoId": "builtin_marvel_universe",
            "keys": [
                "Wakanda",
                "Vibranium",
                "Black Panther"
            ],
            "content": "Wakanda is a technologically advanced African nation, hidden from the world. Rich in Vibranium (the strongest metal on Earth), Wakanda developed incredible technology while maintaining traditional culture. The Black Panther (T'Challa) serves as both king and protector. Key locations include the Golden City and Mount Bashenga. Wakanda opened its borders to the world after centuries of isolation.",
            "enabled": true,
            "constant": false,
            "position": 1,
            "insertionOrder": 60,
            "comment": "Wakanda"
        },
        {
            "id": "entry_006",
            "worldInfoId": "builtin_marvel_universe",
            "keys": [
                "Thanos",
                "Mad Titan"
            ],
            "content": "Thanos, the Mad Titan, sought to balance the universe by eliminating half of all life. Obsessed with collecting the Infinity Stones, he successfully performed 'The Snap' using the complete Infinity Gauntlet. Thanos was eventually defeated by the Avengers in the Battle of Earth. He believed his actions were merciful, aiming to prevent universal resource depletion.",
            "enabled": true,
            "constant": false,
            "position": 1,
            "insertionOrder": 50,
            "comment": "Thanos antagonist"
        },
        {
            "id": "entry_007",
            "worldInfoId": "builtin_marvel_universe",
            "keys": [
                "Tony Stark",
                "Iron Man"
            ],
            "secondaryKeys": [
                "Arc Reactor",
                "Stark Industries"
            ],
            "content": "Tony Stark is a genius billionaire inventor who became Iron Man after being captured by terrorists. He created the Arc Reactor to power his armored suits. As CEO of Stark Industries, he transformed the company from weapons manufacturing to clean energy. Known for his wit and ego, Tony sacrificed himself to save the universe from Thanos, wielding the Infinity Stones despite knowing it would be fatal.",
            "enabled": true,
            "constant": false,
            "selective": true,
            "position": 1,
            "insertionOrder": 110,
            "comment": "Iron Man character"
        },
        {
            "id": "entry_008",
            "worldInfoId": "builtin_marvel_universe",
            "keys": [
                "Multiverse",
                "Doctor Strange",
                "Time Stone"
            ],
            "content": "The Multiverse is an infinite collection of alternate realities and timelines. Doctor Strange (Stephen Strange), Master of the Mystic Arts, protects Earth from mystical threats using the Time Stone (Eye of Agamotto) and ancient spells. The Sanctum Sanctorum in New York serves as a mystical fortress. Time travel and dimensional travel are possible but dangerous, potentially creating paradoxes or attracting entities like Dormammu.",
            "enabled": true,
            "constant": false,
            "position": 1,
            "insertionOrder": 40,
            "comment": "Multiverse and magic"
        }
    ],
    "createdAt": "2026-01-10T07:50:00.000Z",
    "modifiedAt": "2026-01-10T07:50:00.000Z"
}